# Tapping
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "romkatv/powerlevel10k"

# Brew
brew "bat"
brew "go"
brew "hugo"
brew "mas"
brew "md5sha1sum"
brew "openjdk@8"
brew "tmux"
brew "zsh-syntax-highlighting"
brew "romkatv/powerlevel10k/powerlevel10k"

# Cask
cask "alfred"
cask "appcleaner"
cask "google-chrome"
cask "iterm2"
cask "picgo"
cask "snipaste"
cask "typora"
cask "visual-studio-code"

# App Store
mas "WeChat", id: 836500024
mas "Microsoft OneNote", id: 784801555
mas "OneDrive", id: 823766827
mas "RunCat", id: 1429033973
