######## tap ########
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "romkatv/powerlevel10k"

######## brew ########
brew "autoconf"
brew "automake"
brew "bat"
brew "python@3.9"
brew "glib"
brew "pkg-config"
brew "cmake"
brew "coreutils"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnutls"
brew "go"
brew "golangci-lint"
brew "hugo"
brew "mas"
brew "maven"
brew "openjdk@8"
brew "poppler"
brew "rustup-init"
brew "tmux"
brew "tree"
brew "unixodbc"
brew "wget"
brew "zsh-syntax-highlighting"
brew "romkatv/powerlevel10k/powerlevel10k"

######## cask ########
cask "alfred"
cask "appcleaner"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "alacritty"
cask "picgo"
cask "snipaste"
cask "sublime-text"
cask "typora"
cask "visual-studio-code"
cask "intellij-idea-ce"
cask "zotero"
cask "logseq"
cask "obsidian"
cask "notion"
cask "xmind-zen"
cask "intellij-idea-ce"
cask "pycharm-ce"
cask "drawio"
cask "bitwarden"
cask "rectangle"


######## mas ########
# TODO (uncomment after "mas not signed in to Mac App Store" fixing.
# mas "Microsoft OneNote", id: 784801555
# mas "OneDrive", id: 823766827
# mas "RunCat", id: 1429033973
# mas "微信", id: 836500024
# mas "网易云音乐", id: 944848654
